''' 1) პირდაპირ გამოიყენეთ string-ებზე lower, upper, capitalize, მეთოდები კომენტარებით დაწერეთ რა არის მეთოდი რით განსხვავდება ჩვეულებრივი ფუნქციისგან, რა არის dot ნოტაცია. ასევე გააკეთეთ 3 მაგალითი find მეთოდზე, აუცილებლად უნდა იყოს 3 შემთხვევა: error, -1, რაიმე პოზიციას (index) '''


#lower - მეთოდი ცვლადს დაწერს პატარა ასოებით
"string".lower()

#upper - მეთოდი ცვლადს დიდი ასოებით დაწერს
"string".upper()

#capitalize - მეთდი ცვლადის პირველ ასოს დიდად დაწერს
"string".capitalize()


"string".find("g")

"string".find()

"string".find("t")