# IndexError - გამოწვეულია, როცა ვცდილობთ წვდომას ელემენტზე ისეთი სიიდან, ტუპლიდან ან სხვა ინდექსირებულ კოლექციიდან, რომელიც არ არსებობს

# NameError - გამოწვეულაი, როცა ვცდილობთ გამოიყენოთ ცვლადი ან ფუნქცია, რომელიც არ არის განსაზღვრული იმ მომენტისთვის

# SyntaxError - გამოწვეულია, როცა კოდის სინტაქსი არასწორია, ანუ გრამატიკული შეცდომაა კოდში.

# ZeroDivisionError - წარმოიქმნება, როცა რიცხვს ვყოფთ ნულით.

# Bug — არის პროგრამის ლოგიკური შეცდომა, რომელიც იწვევს პროგრამის არ მუშაობს ან არასწორად მუშაობას ისე.

# Error — არის შემთხვევა, რომელიც იწვევს პროგრამის გაჩერებას.

# Error handling - არის შეცდომასთან გამკლავების ხერხები.

# try - ცდა

# except — ეს ბლოკი არის შეცდომის დაჭერისთვის

# else — ეს ბლოკი შესრულდება თუ try-ის კოდი წარმატებით დასრულდა.

# finally — ეს ბლოკი ყოველთვის შესრულდება, მიუხედავად იმისა, მოხდა შეცდომა თუ არა.

try:
    x = 10 / 0  # ZeroDivisionError
except NameError:
    print("არ არის შეცდომა.")
except IndexError:
    print("არ არის შეცდომა ამ შემთხვევაში.")
else:
    print("try-ში შეცდომა არ იყო.")
finally:
    print("ეს ნაწილი ყოველთვის შესრულდება, მიუხედავად ყველაფრის.")
