"""1) მოხმარებელს შემოატანინეთ რიცხვი, შემდეგ კი დაუბეჭდეთ ეს რიცხვი დადებითია, უარყოფითი თუ ნეიტურალი ანუ ნული. შემდეგ კომენტარებით ახსენით რა გასნხვავებაა if-სა და elif-ს შორის რატომ არ შეიძლება ზოგერ elif-ს ნაცვლად if-ის გამოყენება"""

number = (int(input("Enter a random number: ")))

if number > 0:
    print("positive")

elif number < 0:
    print("Negative")

else:
    print("Neutral")


# elif - გამოიყენება მაშინ როდესაც ბევრი პირობაა მოცემული, რომლებიც უნდა შემოწმდნენ
# if - ციკლი გამოიყენება 1 პირობასთან სამუშაოდ